BankXml/MT102_encrypted_and_signed.xml

<?xml version="1.0" encoding="UTF-8" standalone="no"?><SOAP-ENV:Envelope xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/"><SOAP-ENV:Header/><SOAP-ENV:Body><ns4:getMt102Request xmlns:ns2="http://nalogZaPlacanje.xml.com" xmlns:ns3="http://strukturaRtgsNaloga.xml.com" xmlns:ns4="http://mt102.xml.com" xmlns:ns5="http://zahtevzadobijanjeizvoda.xml.com"><xenc:EncryptedData xmlns:xenc="http://www.w3.org/2001/04/xmlenc#" Type="http://www.w3.org/2001/04/xmlenc#Content"><xenc:EncryptionMethod Algorithm="http://www.w3.org/2001/04/xmlenc#tripledes-cbc"/><ds:KeyInfo xmlns:ds="http://www.w3.org/2000/09/xmldsig#">
<ds:KeyName>Sifrovan tajni kljuc</ds:KeyName>
<xenc:EncryptedKey><xenc:EncryptionMethod Algorithm="http://www.w3.org/2001/04/xmlenc#rsa-1_5"/><xenc:CipherData><xenc:CipherValue>CvhELyqr89zNBz1IZiYkqlwNluW6zSZHkHE5Np9FU+0BefJdavJFeo1RO06wQDbjGkY3QCWEH6uR&#13;
sv9Ku6ZRyzyB7/h1FZ1A3Amqnr8a0T4qxuuOeNKnURNLOaJofQuy31Ynj4j2EFBnouhdUcfpNPH2&#13;
KeaqagGuNqr4UNUfbSmA/TeHgiL9wie4u3wH44piG05tLocLdrfbFM56zDYpDkHZ4ZQKK5WrMpsl&#13;
KJthMYUFwPcCggOd5ZzS3545WqXfaVri29O5YMOdhtARz3OePW09ki7c38zGSn2Oh8+956af3avm&#13;
IX+Wn1g6t17HVQFHQVyibpvlIK56+nfpm7H56Q==</xenc:CipherValue></xenc:CipherData></xenc:EncryptedKey></ds:KeyInfo><xenc:CipherData><xenc:CipherValue>om2zoBcYGjoIJquCJWZ8Ed+5OKVdzSdcymxfo1ewlqekUDgi+XE2YHgxCMs2Y5jT2nAAVKprSKlp&#13;
2IP4EI4w7wwTCaYYVihQRoY4jVVkPEpOLDR1c4tCu21WXpn9XpnX3r+nyyreN2PwQ9ZdHHFxAWDd&#13;
0SGsxgnvnY03FVKHezgQRZkjrgSjfKa7zLeKjgNnEvgA8EPPSGSBO8ghU691BlMUcUvEB0Fy3moj&#13;
UTPIwzLiPKZzhEyBdy0mkX5/Gab3b4F486f1/ALcMeYa4UHX0BbJhNU0dW2+7QViwd2NbgdLSGm8&#13;
K3JmeUTkJWJy2kA+rfW9sPUayKfjHrJquasiqwR+nmo98jBxezM+XZaxHoFnBnU+oplf9OK7hDIO&#13;
JVEZz3WoI1RMpLHAyOvstA3JQuy93APl5a6JCoWix3wIxIiMK2xxoG2W09MVVjz0DDebqpBATIuK&#13;
y7dwc1fEVYihLkQ48dH1zgv79os8ijaPZG6Dj30MAtDoeHwd16mXvq3e19LDDLaoRsTMWN1F7uqD&#13;
2/aN6KQvSZDhQRt50RVFspAym5gvP5CY5hyHtr/dDaSpm+BpFom3r6prRMcAbbpXD0indV9/AzhZ&#13;
+MInATh5243eOzAI5IHzTQos0eT7nxiuOtY3QnhpfJfW6zmLP1ywe71ofmfK3dvkaOsJHBETB1Uq&#13;
lfB5nzoDNu3nCY+2rMy3Hdt/Zrngy/8eSNj4nXkebgW5N7S21NSxvTUdx1D2yHeIan8GBd9usbym&#13;
Rkgna5mNx7YRAuxqt7rc00VAmmOUgx05MKcAtzp8jWK+W4O+dlPHTIgZ9seGNekD9KPOojW032K5&#13;
M1ufTfZ/VPIxCCYCXOuCyx0/aX9nkTJ8U6/HEqbSt25eWbgpEBvHjRUCRSTiQXmCkbLDjEqmxYiY&#13;
OgrgM3kAykF8k/MQ5Nn22A6A6K+nYkHNqvSfAFZaSUhW7ud7FByqoJMBabQHeA2/xZ88XiFnyWIP&#13;
5IIZWC+ASelVEhZmY06WuoP+WEvNyxd63FxiY7HY1slN5DqMPfzILfd9JXcMP08hfm3EQu6aXWEV&#13;
dQ94SOq6ANElM5RwdLk8hx8wyosotqjdPKHNQgLBqir+FtbXjW/63pPb3tp7dyBVlhSg+wEm47eN&#13;
sGI+602t/s41oZCNxBum7JHIJeWkp0vnXKdHqG/LO2ONEw2chQafZtOFoCgt6piBZJSgopkDyDAY&#13;
r1avrRKmbD/GHwgn8OaQqmRf5Y+Gwib82cSVopJXhcg43HqbM7zlcgTpJG52u5ivcXf5vEbM8qOa&#13;
8Wl/I4+lFHJ0iXljFNOM7BR7txfFgfifKDmYJD3eh5H6ciV1BrX+EwSx8x4vtXCTy/4tsG872lOA&#13;
r4D4qaE3rawdZlXN8Z/xLLqO5S6LJjDh0EJH4DRRZcp7nXq0gZYZk4YZXJjYIwLuS//xAEoPwYwJ&#13;
v/6UWd/3G2j14CKJKHtwCmXEEIYImD63KdWzxUzbWi/IDK0lvDCpwAfjbChHnV/T989wCvvuTjD1&#13;
Z6uilpV5TsQBN5mXa1IaNI+MHBJ/zNmbYe2PB9bRLD9j8nOPk/mTWpneBhN1J/YZrMX7j4HZTrOQ&#13;
YKN3SSh1/SBjfaYbGhcS0yFwfWAVGn7jTnyS4KTfDYCqdjumUgQwA9rtv9mnnN9+QXrP</xenc:CipherValue></xenc:CipherData></xenc:EncryptedData></ns4:getMt102Request></SOAP-ENV:Body><ds:Signature xmlns:ds="http://www.w3.org/2000/09/xmldsig#">
<ds:SignedInfo>
<ds:CanonicalizationMethod Algorithm="http://www.w3.org/TR/2001/REC-xml-c14n-20010315"/>
<ds:SignatureMethod Algorithm="http://www.w3.org/2000/09/xmldsig#rsa-sha1"/>
<ds:Reference URI="">
<ds:Transforms>
<ds:Transform Algorithm="http://www.w3.org/2000/09/xmldsig#enveloped-signature"/>
<ds:Transform Algorithm="http://www.w3.org/TR/2001/REC-xml-c14n-20010315#WithComments"/>
</ds:Transforms>
<ds:DigestMethod Algorithm="http://www.w3.org/2000/09/xmldsig#sha1"/>
<ds:DigestValue>xL4XxL4niGBSz8O4xCbA0DIGWgk=</ds:DigestValue>
</ds:Reference>
</ds:SignedInfo>
<ds:SignatureValue>
Qkm3i29wEuh2EHY1uKDJrjERQBMTg1bADhKApU+ds0UXkUqXa/Wqs29iCcyBGxJCeajP5SuoQs0L&#13;
2RQMuuCz06BEh4bWN2rsmDAwCxG/e929xmjF49NNWIcjnmYYKEVR7fzwLZ8VUvLy/aTT6n2sKFHK&#13;
v6yLvFTvJDdcS6xdPwdCLY9ULws3H3Uy2nMw02rAADoi3lUFadzziLLE1ujcaCg2Gv9qNmU+zNG8&#13;
3BNnuDghn+gyLezxzjxoIdNZKLBPReaAWmFS5ihcjJ/T2JiPNtqBjxoYMgaQc2mMFvN4iIBO9Q1a&#13;
Mxowjznchi6UkXNn3hTjmeCKDs+2YWrGnQpZPA==
</ds:SignatureValue>
<ds:KeyInfo>
<ds:KeyValue>
<ds:RSAKeyValue>
<ds:Modulus>
iYFqE4e3bUjAttedcKZSAisg5+YICC8Yf0MmjWxsj5XjlN5kZN6T1RC6zXYH7U2nokaxjGxEeKvq&#13;
gvCJfwiBo+t2lGFyaOU3dietqZWr0scIpm0rVoazZPgCzo3PPK1VBWpyOA7/1UZpPJYxIoQq0ZrR&#13;
NGJPIKLff/UQtyjgf1AQZN7+6Ey5MKfG0NNQtvoO8AgL0CGe81+ziZ7GjbIR11OodRAkFxSz7xeb&#13;
DWOWK5L1jDwPPkyoFpyybsD45Vld/1z0M6kDFzyCm/ha37vqGBBGSKudUVztnMY/jwo9ja3Yd93Q&#13;
3Pe2lZfRAj5qykiOd8WEq4KDJ7/zWU1f0nsu5Q==
</ds:Modulus>
<ds:Exponent>AQAB</ds:Exponent>
</ds:RSAKeyValue>
</ds:KeyValue>
<ds:X509Data>
<ds:X509Certificate>
MIIDoDCCAoigAwIBAgIEWUhQxDANBgkqhkiG9w0BAQsFADCBlDEWMBQGA1UEAwwNTmFyb2RuYSBi&#13;
YW5rYTEWMBQGA1UECgwNTmFyb2RuYSBiYW5rYTEWMBQGA1UECwwNTmFyb2RuYSBiYW5rYTEMMAoG&#13;
A1UEBhMDc3JiMSAwHgYJKoZIhvcNAQkBFhFuYXJvZG5hQGJhbmthLmNvbTEaMBgGCgmSJomT8ixk&#13;
AQEMCjE0OTc5MTE0MzgwHhcNMTcwNjE5MDAwMDAwWhcNMTgwNjE5MDAwMDAwWjB6MRAwDgYDVQQD&#13;
DAdCYW5rYSBBMRAwDgYDVQQKDAdCYW5rYSBBMQ4wDAYDVQQLDAVCYW5rYTEMMAoGA1UEBhMDc3Ji&#13;
MRowGAYJKoZIhvcNAQkBFgtiYW5rYUBhLmNvbTEaMBgGCgmSJomT8ixkAQEMCjE0OTc5MTE0OTIw&#13;
ggEiMA0GCSqGSIb3DQEBAQUAA4IBDwAwggEKAoIBAQCJgWoTh7dtSMC2151wplICKyDn5ggILxh/&#13;
QyaNbGyPleOU3mRk3pPVELrNdgftTaeiRrGMbER4q+qC8Il/CIGj63aUYXJo5Td2J62plavSxwim&#13;
bStWhrNk+ALOjc88rVUFanI4Dv/VRmk8ljEihCrRmtE0Yk8got9/9RC3KOB/UBBk3v7oTLkwp8bQ&#13;
01C2+g7wCAvQIZ7zX7OJnsaNshHXU6h1ECQXFLPvF5sNY5YrkvWMPA8+TKgWnLJuwPjlWV3/XPQz&#13;
qQMXPIKb+Frfu+oYEEZIq51RXO2cxj+PCj2Nrdh33dDc97aVl9ECPmrKSI53xYSrgoMnv/NZTV/S&#13;
ey7lAgMBAAGjEzARMA8GA1UdEwEB/wQFMAMBAf8wDQYJKoZIhvcNAQELBQADggEBAG97A295MjBs&#13;
W9KAIx7/VlBabr8edSQbwNqaLPJLT5LeXqrCTaBeBstdUnbxRCduSIoV96h3+ogy22lBm5viOXER&#13;
psHpIRtjoSogXu79aPwGuXfh9ZwcJ0snkOpAC1eITJK2j1gOzT/dj8SY5RP7ptosw0o6HwgzyljK&#13;
O1eNN5AunHsAjCkJMn1eyJJW8bZkjp3HajxoHM5Y7dGc3GYi018+StfkjZC51kj4ZrjRsklhIrrC&#13;
cbKkMsD/PPaZUN96KbMev6exKS3gXxBkyi/4TKpbNblT60MheU7fWgOodF9bswi0x31dftQibjms&#13;
lxmeTI40cje1sxblOwNPGNOc0OA=
</ds:X509Certificate>
</ds:X509Data>
</ds:KeyInfo>
</ds:Signature></SOAP-ENV:Envelope>